HomeWork-3/reports/1.2G/withIndex/wrk-C1.txt
Running 5m test @ http://localhost:5000
  1 threads and 1 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.42ms    4.02ms  44.68ms   84.77%
    Req/Sec   166.43     28.81   250.00     70.91%
  Latency Distribution
     50%    5.27ms
     75%    7.28ms
     90%   12.29ms
     99%   21.39ms
  49750 requests in 5.00m, 62.63MB read
Requests/sec:    165.83
Transfer/sec:    213.78KB