HomeWork-3/reports/1.2G/withIndex/wrk-C100.txt
Running 5m test @ http://localhost:5000
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   729.94ms    1.02s    9.57s    86.27%
    Req/Sec    73.44     36.84   270.00     69.07%
  Latency Distribution
     50%  317.43ms
     75%    1.04s 
     90%    2.12s 
     99%    4.48s 
  87346 requests in 5.00m, 109.96MB read
Requests/sec:    291.06
Transfer/sec:    375.22KB