HomeWork-3/reports/1.2G/withIndex/wrk-C1000.txt
Running 5m test @ http://localhost:5000
  8 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.62s     4.81s   29.99s    84.60%
    Req/Sec    35.25     19.99   277.00     68.37%
  Latency Distribution
     50%    3.50s 
     75%    7.05s 
     90%   11.34s 
     99%   20.18s 
  82052 requests in 5.00m, 103.30MB read
  Socket errors: connect 0, read 0, write 0, timeout 102
Requests/sec:    273.43
Transfer/sec:    352.51KB