HomeWork-3/reports/1.2G/withIndex/wrk2-R1.txt
Running 5m test @ http://localhost:5000
  1 threads and 1 connections
  Thread calibration: mean lat.: 17.356ms, rate sampling interval: 44ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    18.18ms   19.30ms 162.94ms   97.59%
    Req/Sec     0.99      4.59    23.00     95.58%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   13.89ms
 75.000%   19.18ms
 90.000%   23.87ms
 99.000%  145.41ms
 99.900%  163.07ms
 99.990%  163.07ms
 99.999%  163.07ms
100.000%  163.07ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       4.065     0.000000            1         1.00
       9.919     0.100000           29         1.11
      11.167     0.200000           58         1.25
      12.071     0.300000           87         1.43
      13.071     0.400000          116         1.67
      13.887     0.500000          145         2.00
      14.295     0.550000          160         2.22
      15.087     0.600000          175         2.50
      16.031     0.650000          189         2.86
      17.535     0.700000          203         3.33
      19.183     0.750000          218         4.00
      19.663     0.775000          225         4.44
      19.999     0.800000          232         5.00
      20.703     0.825000          240         5.71
      21.359     0.850000          247         6.67
      22.351     0.875000          254         8.00
      23.487     0.887500          258         8.89
      23.871     0.900000          261        10.00
      25.007     0.912500          265        11.43
      27.983     0.925000          269        13.33
      30.303     0.937500          272        16.00
      30.463     0.943750          274        17.78
      31.327     0.950000          276        20.00
      32.799     0.956250          278        22.86
      33.887     0.962500          280        26.67
      34.111     0.968750          281        32.00
      34.655     0.971875          282        35.56
      36.479     0.975000          283        40.00
      49.855     0.978125          284        45.71
     124.927     0.981250          285        53.33
     130.303     0.984375          286        64.00
     130.303     0.985938          286        71.11
     145.407     0.987500          287        80.00
     145.407     0.989062          287        91.43
     148.863     0.990625          288       106.67
     148.863     0.992188          288       128.00
     148.863     0.992969          288       142.22
     149.759     0.993750          289       160.00
     149.759     0.994531          289       182.86
     149.759     0.995313          289       213.33
     149.759     0.996094          289       256.00
     149.759     0.996484          289       284.44
     163.071     0.996875          290       320.00
     163.071     1.000000          290          inf
#[Mean    =       18.179, StdDeviation   =       19.300]
#[Max     =      162.944, Total count    =          290]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%   12.88ms
 75.000%   18.45ms
 90.000%   22.77ms
 99.000%  144.90ms
 99.900%  162.05ms
 99.990%  162.05ms
 99.999%  162.05ms
100.000%  162.05ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.437     0.000000            1         1.00
       9.007     0.100000           29         1.11
      10.047     0.200000           58         1.25
      11.063     0.300000           87         1.43
      12.199     0.400000          116         1.67
      12.879     0.500000          145         2.00
      13.319     0.550000          160         2.22
      14.167     0.600000          174         2.50
      15.231     0.650000          189         2.86
      16.671     0.700000          203         3.33
      18.447     0.750000          218         4.00
      18.703     0.775000          225         4.44
      19.231     0.800000          232         5.00
      19.855     0.825000          240         5.71
      20.495     0.850000          247         6.67
      21.439     0.875000          254         8.00
      22.207     0.887500          258         8.89
      22.767     0.900000          261        10.00
      23.487     0.912500          265        11.43
      26.783     0.925000          269        13.33
      29.183     0.937500          272        16.00
      29.887     0.943750          274        17.78
      30.143     0.950000          276        20.00
      31.375     0.956250          278        22.86
      33.023     0.962500          280        26.67
      33.087     0.968750          281        32.00
      33.311     0.971875          282        35.56
      35.295     0.975000          283        40.00
      48.703     0.978125          284        45.71
     123.391     0.981250          285        53.33
     129.791     0.984375          286        64.00
     129.791     0.985938          286        71.11
     144.895     0.987500          287        80.00
     144.895     0.989062          287        91.43
     148.223     0.990625          288       106.67
     148.223     0.992188          288       128.00
     148.223     0.992969          288       142.22
     148.991     0.993750          289       160.00
     148.991     0.994531          289       182.86
     148.991     0.995313          289       213.33
     148.991     0.996094          289       256.00
     148.991     0.996484          289       284.44
     162.047     0.996875          290       320.00
     162.047     1.000000          290          inf
#[Mean    =       17.249, StdDeviation   =       19.304]
#[Max     =      161.920, Total count    =          290]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  301 requests in 5.00m, 387.43KB read
Requests/sec:      1.00
Transfer/sec:      1.29KB